Revit 2024 API
DocumentReloadLatestProgressChangedEventArgs Class
 The event arguments used during the reload latest phase of [!:Autodesk::Revit::ApplicationServices::Application::WorksharedOperationProgressChanged].
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public class DocumentReloadLatestProgressChangedEventArgs : DataTransferProgressChangedEventArgs
Visual Basic
Public Class DocumentReloadLatestProgressChangedEventArgs _
	Inherits DataTransferProgressChangedEventArgs
Visual C++
public ref class DocumentReloadLatestProgressChangedEventArgs : public DataTransferProgressChangedEventArgs
Remarks
 It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time. Name correction - it is renamed from 'DocumentReloadLatestProgessChangedEventArgs' released since 2017 Subscription Update.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DocumentReloadLatestProgressChangedEventArgs
See Also
DocumentReloadLatestProgressChangedEventArgs Members
Autodesk.Revit.DB.Events Namespace